In [1]:
# Data Indexing and Selection
import pandas as pd

In [2]:
# Series as dictionary
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [3]:
data['b']

0.5

In [4]:
'a' in data

True

In [5]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [6]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [7]:
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [8]:
# slicing by explicit index
# 从a到c
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [10]:
# slicing by implicit integer index
# 从第0位到第1位，不包括第2位
data[0:2]

a    0.25
b    0.50
dtype: float64

In [11]:
# masking
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [95]:
# indexer 
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [96]:
# explicit index when indexing
data[1]

'a'

In [97]:
# implicit index when slicing
# 超过了最大索引，但是也没有报错
data[1:5]

3    b
5    c
dtype: object

In [100]:
# indexer: loc
data.loc[1]

'a'

In [66]:
data.loc[0:4]

1    a
3    b
dtype: object

In [25]:
# indexer: iloc
data.iloc[1]

'b'

In [101]:
data.iloc[0:4]

1    a
3    b
5    c
dtype: object

In [102]:
# DataFrame as a dictionary
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pops = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pops':pops})
data

              area      pops
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [70]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [71]:
# passing a single "index" to a DataFrame accesses a column
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [72]:
#
data.area is data['area']

True

In [103]:
# adding a new column:
data['density'] = data['pops'] / data['area']
data

              area      pops     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [104]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [75]:
# passing a single index to an array accesses a row
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [76]:
# indexer: iloc
data.iloc[:3,:3]

              area      pops     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746

In [84]:
# indexer: loc
data.loc[:'Florida', :'pops']

              area      pops
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860

In [78]:
# 
data.loc[data.density > 100, ['pops', 'density']]

              pops     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [80]:
# modify
data.iloc[0, 2] = 80
data

              area      pops     density
California  423967  38332521   80.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [87]:
# indexing refers to column
data['Florida':'Illinois']

            area      pops     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [92]:
# Above slices can also refer to rows by number 
#   rather than by index
data[3:5]

            area      pops     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [93]:
# direct masking operations are also interpreted 
#    row-wise rather than column-wise
data[data.density > 100]

            area      pops     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121